import{s as H,bF as N,m as y,p as R,bg as P,q as I,b5 as W,cj as M,j as U,a0 as J,k as g,aR as G,c5 as K,W as Y,V as Z,b6 as X,n as $,a2 as ee,a3 as z,a4 as Q,a5 as r,a8 as i,a6 as t,aj as v,aM as O,ab as te,af as _,ag as x,ap as j,a9 as D,b1 as oe,aa as ae,ai as ne,ah as le,a7 as ie,aD as se,ad as re,ae as de,aq as he,aA as ue}from"./index-Vgn11mYe.js";import{a as F}from"./QChip-AeiYZxkt.js";import{g as ce,h as me,i as ge}from"./BrowserInfoDialog-DaD_Av4N.js";import{Q as fe}from"./QTooltip-Bq8fzSeY.js";import{Q as L}from"./QItemLabel-DtnpbpTE.js";import{Q as pe}from"./QList-B8kukOz-.js";import{Q as we}from"./QPage-2Dz5Bkfd.js";import{u as ke}from"./useMetaTags-HXhM7NSO.js";import{T as be}from"./TitleBlock-BMnk5BXk.js";import{F as ye}from"./FAQComponent-DFX8so-I.js";import{S as ve}from"./SeFoComponent-CLqD_edl.js";import{H as _e}from"./H2TitleBlock-Dd6zNymE.js";import{R as xe}from"./finetune-DMx3HIhE.js";import"./use-dialog-plugin-component-BHhbBFhh.js";import"./_setToArray-CiZV4BxF.js";import"./date-BW91LZ05.js";import"./QLinearProgress-CNr-_0OY.js";import"./QMenu-DUdLM9or.js";import"./position-engine-Y88n8Qn3.js";import"./use-fullscreen-BoGsC44s.js";import"./blogs-C0q7z1Oe.js";import"./PurchaseTab-kU92GfJE.js";import"./QExpansionItem-CErDIT4x.js";import"./copy-to-clipboard-B7zsm2Lh.js";import"./VideoDialog-KBArf-YB.js";import"./ClosePopup-CAiKRfJ7.js";import"./useModels-CrnGlWgK.js";import"./orderBy-DW07C2dD.js";import"./isSymbol-CbWR9nRG.js";import"./TouchPan-Cw2NrNyJ.js";import"./touch-BjYP5sR0.js";import"./QTab-DbFJAoOo.js";import"./QTabs-D1zL3gWh.js";import"./QResizeObserver-xH7k8M6g.js";import"./QBtnDropdown-DpFDhfSP.js";import"./QSpinnerRings-hR95xfhg.js";import"./QBanner-CVsqEL4Y.js";import"./PurchaseDialog-8C5MDkFl.js";import"./package-D9JPNs5w.js";import"./QBadge-DjR-5bv2.js";import"./UserAvatarComponent-2mGde48R.js";import"./use-panel-Dp9Pz_oH.js";import"./QForm-H6ZO1f-A.js";import"./se-fo-DU8C6fEY.js";import"./useRoute-sy9a8wJi.js";const Ce=H({name:"QBtnToggle",props:{...N,modelValue:{required:!0},options:{type:Array,required:!0,validator:o=>o.every(a=>("label"in a||"icon"in a||"slot"in a)&&"value"in a)},color:String,textColor:String,toggleColor:{type:String,default:"primary"},toggleTextColor:String,outline:Boolean,flat:Boolean,unelevated:Boolean,rounded:Boolean,push:Boolean,glossy:Boolean,size:String,padding:String,noCaps:Boolean,noWrap:Boolean,dense:Boolean,readonly:Boolean,disable:Boolean,stack:Boolean,stretch:Boolean,spread:Boolean,clearable:Boolean,ripple:{type:[Boolean,Object],default:!0}},emits:["update:modelValue","clear","click"],setup(o,{slots:a,emit:c}){const e=y(()=>o.options.find(s=>s.value===o.modelValue)!==void 0),k=y(()=>({type:"hidden",name:o.name,value:o.modelValue})),b=M(k),n=y(()=>P(o)),d=y(()=>({rounded:o.rounded,dense:o.dense,...n.value})),C=y(()=>o.options.map((s,l)=>{const{attrs:f,value:p,slot:T,...h}=s;return{slot:T,props:{key:l,"aria-pressed":p===o.modelValue?"true":"false",...f,...h,...d.value,disable:o.disable===!0||h.disable===!0,color:p===o.modelValue?u(h,"toggleColor"):u(h,"color"),textColor:p===o.modelValue?u(h,"toggleTextColor"):u(h,"textColor"),noCaps:u(h,"noCaps")===!0,noWrap:u(h,"noWrap")===!0,size:u(h,"size"),padding:u(h,"padding"),ripple:u(h,"ripple"),stack:u(h,"stack")===!0,stretch:u(h,"stretch")===!0,onClick(B){A(p,s,B)}}}}));function A(s,l,f){o.readonly!==!0&&(o.modelValue===s?o.clearable===!0&&(c("update:modelValue",null,null),c("clear")):c("update:modelValue",s,l),c("click",f))}function u(s,l){return s[l]===void 0?o[l]:s[l]}function q(){const s=C.value.map(l=>R(I,l.props,l.slot!==void 0?a[l.slot]:void 0));return o.name!==void 0&&o.disable!==!0&&e.value===!0&&b(s,"push"),W(a.default,s)}return()=>R(F,{class:"q-btn-toggle",...n.value,rounded:o.rounded,stretch:o.stretch,glossy:o.glossy,spread:o.spread},q)}}),E=`
CHAPTER I
Down the Rabbit-Hole
Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do: once or twice she had peeped into the book her sister was reading, but it had no pictures or conversations in it, \`and what is the use of a book,' thought Alice \`without pictures or conversation?'
So she was considering in her own mind (as well as she could, for the hot day made her feel very sleepy and stupid), whether the pleasure of making a daisy-chain would be worth the trouble of getting up and picking the daisies, when suddenly a White Rabbit with pink eyes ran close by her.

There was nothing so very remarkable in that; nor did Alice think it so very much out of the way to hear the Rabbit say to itself, \`Oh dear! Oh dear! I shall be late!' (when she thought it over afterwards, it occurred to her that she ought to have wondered at this, but at the time it all seemed quite natural); but when the Rabbit actually took a watch out of its waistcoat-pocket, and looked at it, and then hurried on, Alice started to her feet, for it flashed across her mind that she had never before seen a rabbit with either a waistcoat-pocket, or a watch to take out of it, and burning with curiosity, she ran across the field after it, and fortunately was just in time to see it pop down a large rabbit-hole under the hedge.

 White Rabbit checking watch

In another moment down went Alice after it, never once considering how in the world she was to get out again.

The rabbit-hole went straight on like a tunnel for some way, and then dipped suddenly down, so suddenly that Alice had not a moment to think about stopping herself before she found herself falling down a very deep well.

Either the well was very deep, or she fell very slowly, for she had plenty of time as she went down to look about her and to wonder what was going to happen next. First, she tried to look down and make out what she was coming to, but it was too dark to see anything; then she looked at the sides of the well, and noticed that they were filled with cupboards and book-shelves; here and there she saw maps and pictures hung upon pegs. She took down a jar from one of the shelves as she passed; it was labelled \`ORANGE MARMALADE', but to her great disappointment it was empty: she did not like to drop the jar for fear of killing somebody, so managed to put it into one of the cupboards as she fell past it.

\`Well!' thought Alice to herself, \`after such a fall as this, I shall think nothing of tumbling down stairs! How brave they'll all think me at home! Why, I wouldn't say anything about it, even if I fell off the top of the house!' (Which was very likely true.)

Down, down, down. Would the fall never come to an end! \`I wonder how many miles I've fallen by this time?' she said aloud. \`I must be getting somewhere near the centre of the earth. Let me see: that would be four thousand miles down, I think--' (for, you see, Alice had learnt several things of this sort in her lessons in the schoolroom, and though this was not a very good opportunity for showing off her knowledge, as there was no one to listen to her, still it was good practice to say it over) \`--yes, that's about the right distance--but then I wonder what Latitude or Longitude I've got to?' (Alice had no idea what Latitude was, or Longitude either, but thought they were nice grand words to say.)

Presently she began again. \`I wonder if I shall fall right through the earth! How funny it'll seem to come out among the people that walk with their heads downward! The Antipathies, I think--' (she was rather glad there was no one listening, this time, as it didn't sound at all the right word) \`--but I shall have to ask them what the name of the country is, you know. Please, Ma'am, is this New Zealand or Australia?' (and she tried to curtsey as she spoke--fancy curtseying as you're falling through the air! Do you think you could manage it?) \`And what an ignorant little girl she'll think me for asking! No, it'll never do to ask: perhaps I shall see it written up somewhere.'

Down, down, down. There was nothing else to do, so Alice soon began talking again. \`Dinah'll miss me very much to-night, I should think!' (Dinah was the cat.) \`I hope they'll remember her saucer of milk at tea-time. Dinah my dear! I wish you were down here with me! There are no mice in the air, I'm afraid, but you might catch a bat, and that's very like a mouse, you know. But do cats eat bats, I wonder?' And here Alice began to get rather sleepy, and went on saying to herself, in a dreamy sort of way, \`Do cats eat bats? Do cats eat bats?' and sometimes, \`Do bats eat cats?' for, you see, as she couldn't answer either question, it didn't much matter which way she put it. She felt that she was dozing off, and had just begun to dream that she was walking hand in hand with Dinah, and saying to her very earnestly, \`Now, Dinah, tell me the truth: did you ever eat a bat?' when suddenly, thump! thump! down she came upon a heap of sticks and dry leaves, and the fall was over.

`,qe=`
羅生門

芥川龍之介

　或日の暮方の事である。一人の下人が、羅生門の下で雨やみを待っていた。　広い門 の下には、この男の外に誰もいない。ただ、所々丹塗の剥げた、大きな円柱に、きりぎ りすが一匹とまっている。羅生門が、朱雀大路にある以上は、この男の外にも、雨やみ をする市女笠や揉烏帽子が、もう二三人はありそうなものである。それが、この男の外 に誰もいない。 　何故かと云うと、この二三年、京都には、地震とか辻風とか火事とか饑饉とか云う災 いがつづいて起こった。そこで洛中のさびれ方は一通りでない。旧記によると、仏像や 仏具を打砕いて、その丹がついたり、金銀の箔（はく）がついたりした木を、路ばたに つみ重ねて薪の料（しろ）に売っていたと云うことである。洛中がその始末であるから、 羅生門の修理などは、元より誰も捨てて顧みる者がなかった。するとその荒れ果てたの をよい事にして、狐狸（こり）が棲む。盗人が棲む。とうとうしまいには、引取り手の ない死人を、この門へ持って来て、捨てて行くと云う習慣さえ出来た。そこで、日の目 が見えなくなると、誰でも気味を悪がって、この門の近所へは足ぶみをしない事になっ てしまったのである。 　その代り又鴉が何処からか、たくさん集まって来た。昼間見ると、その鴉が何羽とな く輪を描いて、高い鴟尾（しび）のまわりを啼きながら、飛びまわっている。殊に門の 上の空が、夕焼けであかくなる時には、それが胡麻をまいたようにはっきり見えた。鴉 は、勿論、門の上にある死人の肉を、啄みに来るのである。ーー尤も今日は、刻限が遅 いせいか、一羽も見えない。唯、所々、崩れかかった、そうしてその崩れ目に長い草の はえた石段の上に、鴉の糞（くそ）が、点々と白くこびりついているのが見える。下人 は七段ある石段の一番上の段に洗いざらした紺の襖（あお）の尻を据えて、右の頬に出 来た、大きな面皰（にきび）を気にしながら、ぼんやり、雨のふるのを眺めているので ある。 　作者はさっき、「下人が雨やみを待っていた」と書いた。しかし、下人は、雨がやん でも格別どうしようと云う当てはない。ふだんなら、勿論、主人の家へ帰る可き筈であ る。所がその主人からは、四五日前に暇を出された。前にも書いたように、当時京都の 町は一通りならず衰微していた。今この下人が、永年、使われていた主人から暇を出さ れたのも、この衰微の小さな余波に外ならない。だから、「下人が雨やみを待っていた」 と云うよりも、「雨にふりこめられた下人が、行き所がなくて、途方にくれていた」と 云う方が、適当である。その上、今日の空模様も少なからずこの平安朝の下人の Sentimentalismeに影響した。申（さる）の刻下がりからふり出した雨は、未だに上 がるけしきがない。そこで、下人は、何を措いても差当たり明日の暮しをどうにかしよ うとしてーー云わばどうにもならない事を、どうにかしようとして、とりとめもない考 えをたどりながら、さっきから朱雀大路にふる雨の音を聞くともなく聞いていた。 　雨は羅生門をつつんで、遠くから、ざあっと云う音をあつめてくる。夕闇は次第に空 を低くして、見上げると、門の屋根が、斜めにつき出した甍（いらか）の先に、重たく うす暗い雲を支えている。 　どうにもならない事を、どうにかする為には、手段を選んでいる遑（いとま）はない。 選んでいれば、築地（ついじ）の下か、道ばたの土の上で、饑死（うえじに）をするば かりである。そうして、この門の上へ持って来て、犬のように捨てられてしまうばかり である。選ばないとすればーー下人の考えは、何度も同じ道を低徊した揚句に、やっと この局所へ逢着した。しかしこの「すれば」は、いつもでたっても、結局「すれば」で あった。下人は、手段を選ばないという事を肯定しながらも、この「すれば」のかたを つける為に、当然、この後に来る可き「盗人になるより外に仕方がない」と云う事を、 積極的に肯定するだけの、勇気が出ずにいたのである。 　下人は大きな嚏（くさめ）をして、それから、大儀そうに立上がった。夕冷えのする 京都は、もう火桶が欲しい程の寒さである。風は門の柱と柱との間を、夕闇と共に遠慮 なく、吹きぬける。丹塗の柱にとまっていたきりぎりすも、もうどこかへ行ってしまっ た。 　下人は、頸をちぢめながら、山吹の汗衫（かざみ）に重ねた、紺の襖の肩を高くして 門のまわりを見まわした。雨風の患のない、人目にかかる惧のない、一晩楽にねられそ うな所があれば、そこでともかくも、夜を明かそうと思ったからである。すると、幸門 の上の楼へ上る、幅の広い、之も丹を塗った梯子が眼についた。上なら、人がいたにし ても、どうせ死人ばかりである。下人は、そこで腰にさげた聖柄（ひじりづか）の太刀 が鞘走らないように気をつけながら、藁草履をはいた足を、その梯子の一番下の段へふ みかけた。 　それから、何分かの後である。羅生門の楼の上へ出る、幅の広い梯子の中段に、一人 の男が、猫のように身をちぢめて、息を殺しながら、上の容子を窺っていた。楼の上か らさす火の光が、かすかに、その男の右の頬をぬらしている。短い鬚（ひげ）の中に、 赤く膿を持った面皰のある頬である。下人は、始めから、この上にいる者は、死人ばか りだと高を括っていた。それが、梯子を二三段上って見ると、上では誰か火をとぼして、 しかもその火を其処此処と動かしているらしい。これは、その濁った、黄いろい光が、 隅々に蜘蛛の巣をかけた天井裏に、ゆれながら映ったので、すぐにそれと知れたのであ る。この雨の夜に、この羅生門の上で、火をともしているからは、どうせ唯の者ではな い。 　下人は、宮守（やもり）のように足音をぬすんで、やっと急な梯子を、一番上の段ま で這うようにして上りつめた。そうして体を出来るだけ、平にしながら、頸を出来るだ け、前へ出して、恐る恐る、楼の内を覗いて見た。 　見ると、楼の内には、噂に聞いた通り、幾つかの屍骸（しがい）が、無造作に棄てて あるが、火の光の及ぶ範囲が、思ったより狭いので、数は幾つともわからない。唯、お ぼろげながら、知れるのは、その中に裸の屍骸と、着物を着た屍骸とがあると云う事で ある。勿論、中には女も男もまじっているらしい。そうして、その屍骸は皆、それが、 嘗（かつて）、生きていた人間だと云う事実さえ疑われる程、土を捏ねて造った人形の ように、口を開いたり、手を延ばしたりして、ごろごろ床の上にころがっていた。しか も、肩とか胸とかの高くなっている部分に、ぼんやりした火の光をうけて、低くなって いる部分の影を一層暗くしながら、永久に唖（おし）の如く黙っていた。 　下人は、それらの屍骸の腐爛した臭気に思わず、鼻を掩った（おおった）。しかし、 その手は、次の瞬間には、もう鼻を掩う事を忘れていた。或る強い感情が殆悉（ほとん どことごとく）この男の嗅覚を奪ってしまったからである。 　下人の眼は、その時、はじめて、其屍骸の中に蹲っている（うずくまっている）人間 を見た。檜肌色（ひはだいろ）の着物を著た、背の低い、痩せた、白髪頭の、猿のよう な老婆である。その老婆は、右の手に火をともした松の木片を持って、その屍骸の一つ の顔を覗きこむように眺めていた。髪の毛の長い所を見ると、多分女の屍骸であろう。 　下人は、六分の恐怖と四分の好奇心とに動かされて、暫時は呼吸（いき）をするのさ え忘れていた。旧記の記者の語を借りれば、「頭身（とうしん）の毛も太る」ように感 じたのである。すると、老婆は、松の木片を、床板の間に挿して、それから、今まで眺 めていた屍骸の首に両手をかけると、丁度、猿の親が猿の子の虱（しらみ）をとるよう に、その長い髪の毛を一本ずつ抜きはじめた。髪は手に従って抜けるらしい。 　その髪の毛が、一本ずつ抜けるのに従って下人の心からは、恐怖が少しずつ消えて行っ た。そうして、それと同時に、その老婆に対するはげしい憎悪が、少しずつ動いて来た。 いや、この老婆に対すると云っては、語弊があるかも知れない。寧（むしろ）、あらゆ る悪に対する反感が、一分毎に強さを増して来たのである。この時、誰かがこの下人に、 さっき門の下でこの男が考えていた、饑死（うえじに）をするか盗人になるかと云う問 題を、改めて持出したら、恐らく下人は、何の未練もなく、饑死を選んだ事であろう。 それほど、この男の悪を憎む心は、老婆の床に挿した松の木片のように、勢よく燃え上 がりだしていたのである。 　下人には、勿論、何故老婆が死人の髪の毛を抜くかわからなかった。従って、合理的 には、それを善悪の何れに片づけてよいか知らなかった。しかし下人にとっては、この 雨の夜に、この羅生門の上で、死人の髪の毛を抜くと云う事が、それだけで既に許す可 らざる悪であった。勿論　下人は　さっき迄自分が、盗人になる気でいた事なぞは　と うに忘れているのである。 　そこで、下人は、両足に力を入れて、いかなり、梯子から上へ飛び上がった　そうし て聖柄（ひじりづか）の太刀に手をかけながら、大股に老婆の前へ歩みよった。老婆が 驚いたのは　云う迄もない。 　老婆は、一目下人を見ると、まるで弩（いしゆみ）にでも弾かれたように　飛び上がっ た。 　「おのれ、どこへ行く。」 　下人は、老婆が屍骸につまづきながら、慌てふためいて逃げようとする行手を塞いで、 こう罵った。老婆は、それでも下人をつきのけて行こうとする。下人は又、それを行か すまいとして、押しもどす。二人は屍骸の中で、暫、無言のまま、つかみ合った。しか し勝負は、はじめから、わかっている。下人はとうとう、老婆の腕をつかんで、無理に そこへねじ倒した。丁度、鶏（とり）の脚のような、骨と皮ばかりの腕である。 　「何をしていた。さあ何をしていた。云え。云わぬと　これだぞよ。」 　下人は、老婆をつき放すと、いきなり、太刀の鞘を払って、白い鋼（はがね）の色を その眼の前へつきつけた。けれども、老婆は黙っている。両手をわなわなふるわせて、 肩で息を切りながら、眼を、眼球がまぶたの外へ出そうになる程、見開いて、唖のよう に執拗（しゅうね）く黙っている。これを見ると、下人は始めて明白にこの老婆の生死 が、全然、自分の意志に支配されていると云う事を意識した。そうして、この意識は、 今まではげしく燃えていた憎悪の心を何時（いつ）の間にか冷ましてしまった。後に残っ たのは、唯、或仕事をして、それが円満に成就した時の、安らかな得意と満足とがある ばかりである。そこで、下人は、老婆を、見下げながら、少し声を柔げてこう云った。 　「己は検非違使（けびいし）の庁の役人などではない。今し方この門の下を通りかかっ た旅の者だ。だからお前に縄をかけて、どうしようと云うような事はない。唯今時分、 この門の上で、何をしていたのだか、それを己に話さえすればいいのだ。」 　すると、老婆は、見開いた眼を、一層大きくして、じっとその下人の顔を見守った。 まぶたの赤くなった、肉食鳥のような、鋭い眼で見たのである。それから、皺で、殆、 鼻と一つになった唇を何か物でも噛んでいるように動かした。細い喉で、尖った喉仏の 動いているのが見える。その時、その喉から、鴉（からす）の啼くような声が、喘ぎ喘 ぎ、下人の耳へ伝わって来た。 　「この髪を抜いてな、この女の髪を抜いてな、鬘（かつら）にしようと思うたの じゃ。」 　下人は、老婆の答が存外、平凡なのに失望した。そうして失望すると同時に、又前の 憎悪が、冷な侮蔑と一しょに、心の中へはいって来た。すると　その気色（けしき）が、 先方へも通じたのであろう。老婆は、片手に、まだ屍骸の頭から奪（と）った長い抜け 毛を持ったなり、蟇（ひき）のつぶやくような声で、口ごもりながら、こんな事を云っ た。 　成程、死人の髪の毛を抜くと云う事は、悪い事かね知れぬ。しかし、こう云う死人の 多くは、皆　その位な事を、されてもいい人間ばかりである。現に、自分が今、髪を抜 いた女などは、蛇を四寸ばかりずつに切って干したのを、干魚（ほしうお）だと云って、 太刀帯（たちはき）の陣へ売りに行った。疫病にかかって死ななかったなら、今でも売 りに行っていたかもしれない。しかも、この女の売る干魚は、味がよいと云うので、太 刀帯たちが、欠かさず菜料に買っていたのである。自分は、この女のした事が悪いとは 思わない。しなければ、饑死（えうじに）をするので、仕方がなくした事だからである。 だから、又今、自分のしていた事も悪い事とは思わない。これもやはりしなければ、饑 死をするので、仕方がなくする事だからである。そうして、その仕方がない事を、よく 知っていたこの女は、自分のする事を許してくれるのにちがいないと思うからであ る。ーー老婆は、大体こんな意味の事を云った。 　下人は、太刀を鞘におさめて、その太刀の柄を左の手でおさえながら、冷然として、 この話を聞いていた。勿論、　右の手では、赤く頬に膿を持た大きな面皰（にきび）を 気にしながら、聞いているのである。しかし、之を聞いている中に、下人の心には、或 勇気が生まれて来た。それは　さっき、門の下でこの男に欠けていた勇気である。そう して、又さっき、この門の上へ上（あが）って、その老婆を捕えた時の勇気とは、全然、 反対な方向に動こうとする勇気である。下人は、饑死をするか盗人になるかに迷わなかっ たばかりではない。その時のこの男の心もちから云えば、饑死などと云う事は、殆、考 える事さえ出来ない程、意識の外に追い出されていた。 　「きっと、そうか。」 　老婆の話が完ると、下人は嘲（あざけ）るような声で念を押した。そうして、一足前 へ出ると、不意に、右の手を面皰から離して、老婆の襟上（えりがみ）をつかみながら、 こう云った。 　「では、己が引剥（ひはぎ）をしようと恨むまいな。己もそうしなければ、饑死をす る体なのだ。」 　下人は、すばやく、老婆の着物を剥ぎとった。それから、足にしがみつこうとする老 婆を、手荒く屍骸の上へ蹴倒した。梯子の口までは、僅に五歩を数えるばかりである。 下人は、剥ぎとった桧肌色の着物をわきにかかえて、またたく間に急な梯子を夜の底へ かけ下りた。 　暫、死んだように倒れていた老婆が、屍骸の中から、その裸の体を起こしたのは、そ れから間もなくの事である。老婆は、つぶやくような、うめくような声を立てながら、 まだ燃えている火の光をたよりに、梯子の口まで、這って行った。そうして、そこから、 短い白髪を倒（さかさま）にして、門の下を覗きこんだ。外には、唯、黒洞々（こくと うとう）たる夜があるばかりである。 　下人は、既に、雨を冒して、京都の町へ強盗を働きに急いでいた。

*** END OF THE PROJECT GUTENBERG EBOOK 羅生門 ***
`,Te=`
漢書 卷一

【高帝紀第一】

　　高祖，沛豐邑中陽裏人也，姓劉氏。母媼嘗息大澤之陂，夢與神遇。是時雷電晦冥 ，父太公往視，則見交龍於上。已而有娠，遂產高祖。

　　高祖為人，隆准而龍顏，美須髯，左股有七十二黑子。寬仁愛人，意豁如也。常有 大度，不事家人生產作業。及壯，試吏，為泗上亭長，延中吏無所不狎侮。好酒及色。 常從王媼、武負貰酒，時飲醉臥，武負、王媼見其上常有怪。高祖每酤留飲，酒讎數倍 。及見怪，歲竟，此兩家常折券棄責。

　　高祖常徭咸陽，縱觀秦皇帝，喟然大息，曰：「嗟乎，大丈夫當如此矣！」

　　單父人呂公善沛令，辟仇，從之客，因家焉。沛中豪傑吏聞令有重客，皆往賀。蕭 何為主吏，主進，令諸大夫曰：「進不滿千錢，坐之堂下。」高祖為亭長，素易諸吏， 乃給為謁曰「賀錢萬」，實不持一錢。謁入，呂公大驚，起，迎之門。呂公者，好相人 ，見高祖狀貌，因重敬之，引入坐上坐。蕭何曰：「劉季固多大言，少成事。」高祖因 狎侮諸客，遂坐上坐，無所詘。酒闌，呂公因目固留高祖。竟酒，後。呂公曰：「臣少 好相人，相人多矣，無如季相，願季自愛。臣有息女，願為箕帚妾。」酒罷，呂媼怒呂 公曰：「公始常欲奇此女，與貴人。沛令善公，求之不與，何自妄許與劉季？」呂公曰 ：「此非兒女子所知。」卒與高祖。呂公女即呂後也，生孝惠帝、魯元公主。

　　高祖嘗告歸之田。呂後與兩子居田中，有一老父過，請飲，呂後因餔之。老父相後 曰：「夫人天下貴人也。」令相兩子，見孝惠帝，曰：「夫人所以貴者，乃此男也。」 相魯元公主，亦皆貴。老父已去，高祖適從旁舍來，呂後具言：「客有過，相我子母皆 大貴。」高祖問，曰：「未遠。」乃追及，問老父。老父曰：「鄉者夫人兒子皆以君， 君相貴不可言。」高祖乃謝曰：「誠如父言，不敢忘德。」及高祖貴，遂不知老父處。

　　高祖為亭長，乃以竹皮為冠，令求盜之薛治，時時冠之，及貴常冠，所謂「劉氏冠 」也。

　　高祖以亭長為縣送徒驪山，徒多道亡。自度比至皆亡之，到豐凱撒中亭，止飲，夜 皆解縱所送徒，曰：「公等皆去，吾亦從此逝矣！」徒中壯士願從者十餘人。高祖被酒 ，夜徑澤中，令一人行前。行前者還報曰：「前有大蛇當徑，願還。」高祖醉，曰：「 壯士行，何畏！」乃前，拔劍斬蛇。蛇分為兩，道開。行數裏，醉困臥。後人來至蛇所 ，有一老嫗夜哭。人問嫗何哭，嫗曰：「人殺吾子。」人曰：「嫗子何為見殺？」嫗曰 ：「吾子，白帝子也，化為蛇當道，今者赤帝子斬之，故哭。」人乃以嫗為不誠，欲苦 之，嫗因忽不見。後人至，高祖覺。告高祖，高祖乃心獨喜，自負。諸從者日益畏之。

　　秦始皇帝嘗曰「東南有天子氣」，於是東遊以當之。高祖隱于芒、碭山澤間，呂後 與人俱求，常得之。高祖怪問呂後，後曰：「季所居上常有雲氣，故從往常得季。」高 祖又喜。沛中子弟或聞之，多欲附者。

　　秦二世元年秋七月，陳涉起蘄。至陳，自立為楚王，遣武臣、張耳、陳餘略趙地。 八月，武臣自立為趙王。郡縣多殺長吏以應涉。九月，沛令欲以沛應之。掾、主吏蕭何 、曹參曰：「君為秦吏，今欲背之，帥沛子弟，恐不聽。願君召諸亡在外者，可得數百 人，因以劫眾，眾不敢不聽。」乃令樊噲召高祖。高祖之眾已數百人矣。

　　於是樊噲從高祖來。沛令後悔，恐其有變，乃閉城城守，欲誅蕭、曹。蕭、曹恐， 逾城保高祖。高祖乃書帛射城上，與沛父老曰：「天下同苦秦久矣。今父老雖為沛令守 ，諸侯並起，今屠沛。沛令共誅令，擇可立立之，以應諸侯，即室家完。不然，父子俱 屠，無為也。」父老乃帥子弟共殺沛令，開城門迎高祖，欲以為沛令。高祖曰：「天下 方擾，諸侯並起，今置將不善，一敗塗地。吾非敢自愛，恐能薄，不能完父兄子弟。此 大事，願更擇可者。」蕭、曹皆文吏，自愛，恐事不就，後秦種族其家，盡讓高祖。諸 父老皆曰：「平生所聞劉季奇怪，當貴，且蔔筮之，莫如劉季最吉。」高祖數讓，眾莫 肯為，高祖乃立為沛公。祠黃帝，祭蚩尤於沛廷，而釁鼓。旗幟皆赤，由所殺蛇白帝子 ，殺者赤帝子故也。於是少年豪吏如蕭、曹、樊噲等皆為收沛子弟，得三千人。

　　是月，項梁與兄子羽起吳。田儋與從弟榮、橫起齊，自立為齊王。韓廣自立為燕王 。魏咎自立為魏王。陳涉之將周章西入關，至戲，秦將章邯距破之。

　　秦二年十月，沛公攻胡陵、方與，還守豐。秦泗川監平將兵圍豐。二日，出與戰， 破之。令雍齒守豐。十一月，沛公引兵之薛。秦泗川守壯兵敗于薛，走至戚，沛公左司 馬得殺之。沛公還軍亢父，至方與。趙王武臣為其將所殺。十二月，楚王陳涉為其禦所 殺。魏人周市略地豐、沛，使人謂雍齒曰：「豐，故梁徙也。今魏地已定者數十城，齒 今下魏，魏以齒為侯守豐；不下，且屠豐。」雍齒雅不欲屬沛公，及魏招之，即反為魏 守豐。沛公攻豐，不能取。沛公還之沛，怨雍齒與豐子弟畔之。

　　正月，張耳等立趙後趙歇為趙王。東陽甯君、秦嘉立景駒為楚王，在留。沛公往從 之，道得張良，遂與俱見景駒，請兵以攻豐。時章邯從陳，別將司馬將兵北定楚地，屠 相，至碭。東陽甯君、沛公引兵西，與戰蕭西，不利，還收兵聚留。

　　二月，攻碭，三日拔之。收碭兵，得六千人，與故合九千人。三月，攻下邑，拔之 。還擊豐，不下。四月，項梁擊殺景駒、秦嘉，止薛，沛公往見之。項梁益沛公卒五千 人，五大夫將十人。沛公還，引兵攻豐，拔之。雍齒奔魏。五月，項羽拔襄城還。項梁 盡召別將。

　　六月，沛公如薛，與項梁共立楚懷王孫心為楚懷王。章邯破殺魏王咎、齊王田儋於 臨濟。七月，大霖雨。沛公攻亢父。章邯圍田榮于東阿。沛公與項梁共救田榮，大破章 邯東阿。田榮歸，沛公、項羽追北，至城陽，攻屠其城。軍濮陽東，複與章邯戰，又破 之。

　　章邯複振，守濮陽，環水。沛公、項羽去攻定陶。八月，田榮立田儋子市為齊王。 定陶未下，沛公與項羽西略地至雍丘，與秦軍戰，大敗之，斬三川守李由。還攻外黃， 外黃未下。

　　項梁再破秦軍，有驕色。宋義諫，不聽。秦益章邯兵。九月，章邯夜銜枚擊項梁定 陶，大破之，殺項梁。時連雨自七月至九月。沛公、項羽方攻陳留，聞梁死，士卒恐， 乃與將軍呂臣引兵而東，徙懷王自盱台都彭城。呂臣軍彭城東，項羽軍彭城西，沛公軍 碭。魏咎弟豹自立為魏王。後九月，懷王並呂臣、項羽軍自將之。以沛公為碭郡長，封 武安侯，將碭郡兵。以羽為魯公，封長安侯。呂臣為司徒，其父呂青為令尹。

　　章邯已破項梁，以為楚地兵不足憂，乃渡河北擊趙王歇，大破之。歇保巨鹿城，秦 將王離圍之。趙數請救，懷王乃以宋義為上將，項羽為次將，範增為末將，北救趙。

　　初，懷王與諸將約，先入定關中者王之。當是時，秦兵強，常乘勝逐北，諸將莫利 先入關。獨羽怨秦破項梁，奮勢，願與沛公西入關。懷王諸老將皆曰：「項羽為人慓悍 禍賊，嘗攻襄城，襄城無噍類，所過無不殘滅。且楚數進取，前陳王、項梁皆敗，不如 更遣長者扶義而西，告諭秦父兄。秦父兄苦其主久矣，今誠得長者往，毋侵暴，宜可下 。項羽不可遣，獨沛公秦寬大長者。」卒不許羽，而遣沛公西收陳王、項梁散卒。乃道 碭至城陽與杠裏，攻秦軍壁，破其二軍。

　　秦三年十月，齊將田都畔田榮，將兵助項羽救趙。沛公攻破東郡尉于成武。

　　十一月，項羽殺宋義，並其兵渡河，自立為上將軍，諸將黥布等皆屬。

　　十二月，沛公引兵至栗，遇剛武侯，奪其軍四千餘人，並之，與魏將皇欣、武滿軍 合攻秦軍，破之。故齊王建孫田安下濟北，從項羽救趙。羽大破秦軍巨鹿下，虜王離， 走章邯。

　　二月，沛公從碭北攻昌邑，遇彭越。越助攻昌邑，未下。沛公西過高陽，酈食其為 裏監門，曰：「諸將過此者多，吾視沛公大度。」乃求見沛公。沛公方踞床，使兩女子 洗。酈生不拜，長揖曰：「足下必欲誅無道秦，不宜踞見長者。」於是沛公起，攝衣謝 之，延上坐。食其說沛公襲陳留。沛公以為廣野君，以其弟商為將，將陳留兵。

  三月，攻開封，未拔。西與秦將楊熊會戰白馬，又戰曲遇東，大破之。楊熊走之滎
陽，二世使使斬之以徇。四月，南攻潁川，屠之。因張良遂略韓地。
  時趙別將司馬卬方欲渡河入關，沛公乃北攻平陰，絕河津。南，戰雒陽東，軍不利
，從轘轅至陽城，收軍中馬騎。
　　六月，與南陽守齮戰犨東，破之。略南陽郡，南陽守走，保城守宛。沛公引兵過宛 西。張良諫曰：「沛公雖欲急入關，秦兵尚眾，距險。今不下宛，宛從後擊，強秦在前 ，此危道也。」於是沛公乃夜引軍從他道還，偃旗幟，遲明，圍宛城三匝。南陽守欲自 剄，其舍人陳恢曰：「死未晚也。」乃逾城見沛公，曰：「臣聞足下約先入咸陽者王之 ，今足下留守宛。宛郡縣連城數十，其吏民自以為降必死，故皆堅守乘城。今足下盡日 止攻，士死傷者必多；引兵去，宛必隨足下。前則失咸陽之約，後有強宛之患。為足下 計，莫若約降，封其守，因使止守，引其甲卒與之西。諸城未下者，聞聲爭開門而待足 下，足下通行無所累。」沛公曰：「善。」七月，南陽守齮降，封為殷侯，封陳恢千戶 。引兵西，無不下者。至丹水，高武侯鰓、襄侯王陵降。還攻胡陽，遇番君別將梅鋗， 與偕攻析、酈，皆降。所過毋得鹵掠，秦民喜。遣魏人甯昌使秦。是月，章邯舉軍降項 羽，羽以為雍王。瑕丘申陽下河南。

　　八月，沛公攻武關，入秦。秦相趙高恐，乃殺二世，使人來，欲約分王關中，沛公 不許。九月，趙高立二世兄子子嬰為秦王。子嬰誅滅趙高，遣將將兵距嶢關。沛公欲擊 之，張良曰：「秦兵尚強，未可輕。願先遣人益張旗幟於山上為疑兵，使酈食其、陸賈 往說秦將，啗以利。」秦將果欲連和，沛公欲許之。張良曰：「此獨其將欲叛，恐其士 卒不從，不如因其怠懈擊之。」沛公引兵繞嶢關，逾蕢山，擊秦軍，大破之藍田南。遂 至藍田，又戰其北，秦兵大敗。

　　元年冬十月，五星聚于東井。沛公至霸上。秦王子嬰素車白馬，系頸以組，封皇帝 璽、符、節、降枳道旁。諸將或言誅秦王，沛公曰：「始懷王遣我，固以能寬容，且人 已服降，殺之不祥。」乃以屬吏。遂西入咸陽。欲止宮休舍，樊噲、張良諫，乃封秦重 寶財物府庫，還軍霸上。蕭何盡收秦丞相府圖籍文書。十一月，召諸縣豪桀曰：「父老 苦秦苛法久矣，誹謗者族，耦語者棄市。吾與諸侯約，先入關者王之，吾當王關中。與 父老約法三章耳：殺人者死，傷人及盜抵罪。余悉除去秦法。吏民皆按堵如故。凡吾所 以來，為父兄除害，非有所侵暴，毋恐！且吾所以軍霸上，待諸侯至而定要束耳。」乃 使人與秦吏行至縣、鄉、邑告諭之。秦民大喜，爭持牛、羊、酒食獻享軍士。沛公讓不 受，曰：「倉粟多，不欲費民。」民又益喜，唯恐沛公不為秦王。

　　或說沛公曰：「秦富十倍天下，地形強。今聞章邯降項羽，羽號曰雍王，王關中。 即來，沛公恐不得有此。可急使守函谷關，毋內諸侯軍，稍征關中兵以自益，距之。」 沛公然其計，從之。十二月，項羽果帥諸侯兵欲西入關，關門閉。聞沛公已定關中，羽 大怒，使黥布等攻破函谷關，遂至戲下。沛公左司馬曹毋傷聞羽怒，欲攻沛公，使人言 羽曰：「沛公欲王關中，令子嬰相，珍寶盡有之。」欲以求封。亞父范增說羽曰：「沛 公居山東時，貪財好色。今聞其入關，珍物無所取，婦女無所幸，此其志不小。吾使人 望其氣，皆為龍，成五色，此天子氣。急擊之，勿失。」於是饗士，旦日合戰。是時， 羽兵四十萬，號百萬。沛公兵十萬，號二十萬，力不敵。會羽季父左尹項伯素善張良， 夜馳見張良，具告其實，欲與俱去，毋特俱死。良曰：「臣為韓王送沛公，不可不告， 亡去不義。」乃與項伯俱見沛公。沛公與伯約為婚姻，曰：「吾入關，秋毫無所敢取， 籍吏民，封府庫，待將軍。所以守關者，備他盜也。日夜望將軍到，豈敢反邪！願伯明 言不敢背德。」項伯許諾，即夜複去，戒沛公曰：「旦日不可不早自來謝。」項伯還， 具以沛公言告羽，因曰：「沛公不先破關中兵，公巨能入乎？且人有大功，擊之不祥， 不如因善之。」羽許諾。

　　沛公旦日從百餘騎見羽鴻門，謝曰：「臣與將軍戮力攻秦，將軍戰河北，臣戰河南 ，不自意先入關，能破秦，與將軍複相見。今者有小人言，令將軍與臣有隙。」羽曰： 「此沛公左司馬曹毋傷言之，不然，籍何以至此？」羽因留沛公飲。範增數目羽擊沛公 ，羽不應。范增起，出謂項莊曰：「君王為人不忍，汝入以劍舞，因擊沛公，殺之。不 者，汝屬且為所虜。」莊入為壽。壽畢，曰：「軍中無以為樂，請以劍舞。」因拔劍舞 。項伯亦起舞，常以身翼蔽沛公。樊噲聞事急，直入，怒甚。羽壯之，賜以酒。噲因譙 讓羽。有頃，沛公起如廁，招樊噲出，置車官屬，獨騎，樊噲、靳強、滕公、紀成步， 從間道走軍，使張良留謝羽。羽問：「沛公安在？」曰：「聞將軍有意督過之，脫身去 ，間至軍，故使臣獻璧。」羽受之。又獻玉鬥範增。增怒，撞其鬥，起曰：「吾屬今為 沛公虜矣！」

　　沛公歸數日，羽引兵西屠咸陽，殺秦降王子嬰，燒秦宮室，所過殘滅，秦民大失望 。羽使人還報懷王，懷王曰：「如約。」羽怨懷王不肯令與沛公俱西入關而北救趙，後 天下約。乃曰：「懷王者，吾家所立耳，非有功伐，何以得專主約！本定天下，諸將與 籍也。」春正月，陽尊懷王為義帝，實不用其命。

　　二月，羽自立為西楚霸王，王梁、楚地九郡，都彭城。背約，更立沛公為漢王，王 巴、蜀、漢中四十一縣，都南鄭。三分關中，立秦三將，章邯為雍王，都廢丘；司馬欣 為塞王，都櫟陽；董翳為翟王，都高奴。楚將瑕丘申陽為河南王，都洛陽。趙將司馬卬 為殷王，都朝歌。當陽君英布為九江王，都六。懷王柱國共敖為臨江王，都江陵。番君 吳芮為衡山王，都邾。故齊王建孫田安為濟北王。徙魏王豹為西魏王，都平陽。徙燕王 韓廣為遼東王。燕將臧荼為燕王，都薊。徙齊王田市為膠東王。齊將田都為齊王，都臨 菑。徙趙王歇為代王。趙相張耳為常山王。漢王怨羽之背約，欲攻之，丞相蕭何諫，乃 止。

　　夏四月，諸侯罷戲下，各就國。羽使卒三萬人從漢王，楚子、諸侯人之慕從者數萬 人，從杜南入蝕中。張良辭歸韓，漢王送至褒中，因說漢王燒絕棧道，以備諸侯盜兵， 亦視項羽無東意。

　　漢王既至南鄭，諸將及士卒皆歌謳思東歸，多道亡還者。韓信為治粟都尉，亦亡去 。蕭何追還之，因薦于漢王，曰：「必欲爭天下，非信無可與計事者。」於是漢王齊戒 設壇場，拜信為大將軍，問以計策。信對曰：「項羽背約而王君王于南鄭，是遷也。吏 卒畢山東之人，日夜企而望歸，及其鋒而用之，可以有大功。天下已定，民皆自寧，不 可複用。不如決策東向。」因陳羽可圖、三秦易並之計。漢王大說，遂聽信策，部署諸 將。留蕭何收巴、蜀租，給軍糧食。

　　五月，漢王引兵從故道出襲雍。雍王邯迎擊漢陳倉，雍兵敗，還走；戰好畤，又大 敗，走廢丘。漢王遂定雍地。東如咸陽，引兵圍雍王廢丘，而遣諸將略地。

　　田榮聞羽徙齊王市于膠東而立田都為齊王，大怒，以齊兵迎擊田都。都走降楚。六 月，田榮殺田市，自立為齊王。時彭越在巨野，眾萬餘人，無所屬。榮與越將軍印，因 令反梁地。越擊殺濟北王安，榮遂並三齊之地。燕王韓廣亦不肯徙遼東。秋八月，臧荼 殺韓廣，並其地。塞王欣、翟王翳皆降漢。

　　初，項梁立韓後公子成為韓王，張良為韓司徒。羽以良從漢王，韓王成又無功，故 不遣就國，與俱至彭城，殺之。及聞漢王並關中，而齊、梁畔之，羽大怒，乃以故吳令 鄭昌為韓王，距漢。令蕭公角擊彭越，越敗角兵。時張良徇韓地，遺羽書曰：「漢欲得 關中，如約即止，不敢複東。」羽以故無西意，而北擊齊。

　　九月，漢王遣將軍薛歐、王吸出武關，因王陵兵，從南陽迎太公、呂後於沛。羽聞 之，發兵距之陽夏，不得前。

　　二年冬十月，項羽使九江王布殺義帝於郴。陳餘亦怨羽獨不王己，從田榮借助兵， 以擊常山王張耳。耳敗走降漢，漢王厚遇之。陳餘迎代王歇還趙，歇立餘為代王。張良 自韓間行歸漢，漢王以為成信侯。

　　漢王如陝，鎮撫關外父老。河南王申陽降，置河南郡。使韓太尉韓信擊韓，韓王鄭 昌降。十一月，立韓太尉信為韓王。漢王還歸，都櫟陽，使諸將略地，拔隴西。以萬人 若一郡降者，封萬戶。繕治河上塞。故秦菀囿園池，令民得田之。

　　春正月，羽擊田榮城陽，榮敗走平原，平原民殺之。齊皆降楚，楚焚其城郭，齊人 複畔之。諸將拔北地，虜雍王弟章平。赦罪人。

　　二月癸未，令民除秦社稷，立漢社稷。施恩德，賜民爵。蜀、漢民給軍事勞苦，複 勿租稅二歲。關中卒從軍者，複家一歲。舉民年五十以上，有修行，能帥眾為善，置以 為三老，鄉一人。擇鄉三老一人為縣三老，與縣令、丞、尉以事相教，複勿徭戍。以十 月賜酒肉。

　　三月，漢王自臨晉渡河。魏王豹降，將兵從。下河內，虜殷王卬，置河內郡。至脩 武，陳平亡楚來降。漢王與語，說之，使參乘，監諸將。南渡平陰津，至洛陽，新城三 老董公遮說漢王曰：「臣聞『順德者昌，逆德者亡』，『兵出無名，事故不成』。故曰 ：『明其為賊，敵乃可服。』項羽為無道，放殺其主，天下之賊也。夫仁不以勇，義不 以力，三軍之眾為之素服，以告之諸侯，為此東伐，四海之內莫不仰德。此三王之舉也 。」漢王曰：「善。非夫子無所聞。」於是漢王為義帝發喪，袒而大哭，哀臨三日。發 使告諸侯曰：「天下共立義帝，北面事之。今項羽放殺義帝江南，大逆無道。寡人親為 發喪，兵皆縞素。悉發關中兵，收三河士，南浮江、漢以下，願從諸侯王擊楚之殺義帝 者。」

　　夏四月，田榮弟橫收得數萬人，立榮子廣為齊王。羽雖聞漢東，既擊齊，欲遂破之 而後擊漢，漢王以故得劫五諸侯兵東伐楚。到外黃，彭越將三萬人歸漢。漢王拜越為魏 相國，令定梁也。

　　漢王遂入彭城，收羽美人貨賂，置酒高會。羽聞之，令其將擊齊，而自以精兵三萬 人從魯出胡陵，至蕭、晨擊漢軍，大戰彭城靈壁東睢水上，大破漢軍，多殺士卒，睢水 為之不流。圍漢王三匝。大風從西北起，折木髮屋，揚砂石，晝晦，楚軍大亂，而漢王 得與數十騎遁去。過沛，使人求室家，室家亦已亡，不相得。漢王道逢孝惠、魯元，載 行。楚騎追漢王，漢王急，推墮二子。滕公下收載，遂得脫。審食其從太公、呂後間行 ，反遇楚軍，羽常置軍中以為質。諸侯見漢敗，皆亡去。塞王欣、翟王翳降楚，殷王卬 死。

　　呂後兄周呂侯將兵居下邑，漢王從之。稍收士卒，軍碭。

　　漢王西過梁地，至虞，謂謁者隨何曰：「公能說九江王布使舉兵畔楚，項王必留擊 之。得留數月，吾取天下必矣。」隨何往說布，果使畔楚。

　　五月，漢王屯滎陽，蕭何發關中老弱未傅者悉詣軍。韓信亦收兵與漢王會，兵複大 振。與楚戰滎陽南京、索間，破之。築甬道屬河，以取敖倉粟。魏王豹謁歸視親疾。至 則絕河津，反為楚。

　　六月，漢王還櫟陽。壬午，立太子，赦罪人。令諸侯子在關中者皆集櫟陽為衛。引 水灌廢丘，廢丘降，章邯自殺。雍地定，八十餘縣，置河上、渭南、中地、隴西、上郡 。令祠官祀天地、四方、上帝、山川，以時祠之。興關中卒乘邊塞。關中大饑，米斛萬 錢，人相食。令民就食蜀、漢。

　　秋八月，漢王如滎陽，謂酈食其曰：「緩頰往說魏王豹，能下之，以魏地萬戶封生 。」食其往，豹不聽。漢王以韓信為左丞相，與曹參、灌嬰俱擊魏。食其還，漢王問： 「魏大將誰也？」對曰：「柏直。」王曰：「是口尚乳臭，不能當韓信。騎將誰也？」 曰：「馮敬。」曰：「是秦將馮無擇子也。雖賢，不能當灌嬰。步卒將誰也？」曰：「 項它。」曰：「不能當曹參。吾無患矣。」

  九月，信等虜豹，傳詣滎陽。定魏地，置河東、太原、上黨郡。信使人請兵三萬人
，願以北舉燕、趙，東擊齊，南絕楚糧道。漢王與之。
  三年冬十月，韓信、張耳東下井陘擊趙，斬陳餘，獲趙王歇。置常山、代郡。甲戌
晦，日有食之。
  十一月癸卯晦，日有食之。隨何既說黥布，布起兵攻楚。楚使項聲、龍且攻布，布
戰不勝。
　　十二月，布與隨何間行歸漢。漢王分之兵，與俱收兵至成皋。

　　項羽數侵奪漢甬道，漢軍乏食，與酈食其謀橈楚權。食其欲立六國後以樹党，漢王 刻印，將遣食其立之。以問張良，良發八難。漢王輟飯吐哺，曰：「豎儒幾敗乃公事！ 」令趨銷印。又問陳平，乃從其計，與平黃金四萬斤，以間疏楚君臣。

　　夏四月，項羽圍漢滎陽，漢王請和，割滎陽以西者為漢。亞父勸項羽急攻滎陽，漢 王患之。陳平反間既行，羽果疑亞父。亞父大怒而去，發病死。

　　五月，將軍紀信曰：「事急矣！臣請誑楚，可以間出。」於是陳平夜出女子東門二 千余人，楚因四面擊之。紀信乃乘王車，黃屋左纛，曰：「食盡，漢王降楚。」楚皆呼 萬歲，之城東觀，以故漢王得與數十騎出西門遁。令御史大夫周苛、魏豹、樅公守滎陽 。羽見紀信，問：「漢王安在？」曰：「已出去矣。」羽燒殺信。而周苛、樅公相謂曰 ：「反國之王，難與守城。」因殺魏豹。

　　漢王出滎陽，至成皋。自成皋入關，收兵欲複東。轅生說漢王曰：「漢與楚相距滎 陽數歲，漢常困。願君王出武關，項王必引兵南走，王深壁，令滎陽、成皋間且得休息 。使韓信等得輯河北趙地，連燕、齊，君王乃複走滎陽。如此，則楚所備者多，力分。 漢得休息，複與之戰，破之必矣。」漢王從其計，出軍宛、葉間，與黥布行收兵。

　　羽聞漢王在宛，果引兵南，漢王堅壁不與戰。是月，彭越渡睢，與項聲、薛公戰下 邳，破殺薛公。羽使終公守成皋，而自東擊彭越。漢王引兵北，擊破終公，複軍成皋。

　　六月，羽已破走彭越，聞漢複軍成皋，乃引兵西拔滎陽城，生得周苛。羽謂苛：「 為我將，以公為上將軍，封三萬戶。」周苛罵曰：「若不趨降漢，今為虜矣！若非漢王 敵也。」羽亨周苛，並殺樅公，而虜韓王信，遂圍成皋。漢王跳，獨與滕公共車出成皋 玉門，北渡河，宿小修武。自稱使者，晨馳入張耳、韓信壁而奪之軍。乃使張耳北收兵 趙地。

　　秋七月，有星孛於大角。漢王得韓信軍，複大振。

　　八月，臨河南鄉，軍小修武，欲複戰。郎中鄭忠說止漢王，高壘深塹勿戰。漢王聽 其計，使盧綰、劉賈將卒二萬人，騎數百，渡白馬津入楚地，佐彭越燒楚積聚，複擊破 楚軍燕郭西，攻下睢陽、外黃十七城。

　　九月，羽謂海春侯大司馬曹咎曰：「謹守成皋。即漢王欲挑戰，慎勿與戰，勿令得 東而已。我十五日必定梁地，複從將軍。」羽引兵東擊彭越。

　　漢王使酈食其說齊王田廣，罷守兵與漢和。

　　四年冬十月，韓信用蒯通計，襲破齊。齊王亨酈生，東走高密。項羽聞韓信破齊， 且欲擊楚，使龍且救齊。

　　漢果數挑成皋戰，楚軍不出。使人辱之數日，大司馬咎怒，渡兵汜水。士卒半渡， 漢擊之，大破楚軍，盡得楚國金玉貨賂。大司馬咎、長史欣皆自剄汜水上。漢王引兵渡 河，複取成皋，軍廣武，就敖倉食。

　　羽下樑地十余城，聞海春侯破，乃引兵還。漢軍方圍鐘離末于滎陽東，聞羽至， 盡走險阻。羽亦軍廣武，與漢相守。丁壯苦軍旅，老弱罷轉餉。漢王、羽相與臨廣武之 間而語。羽欲與漢王獨身挑戰，漢王數羽曰：「吾始與羽俱受命懷王，曰先定關中者王 之。羽負約，王我於蜀、漢，罪一也。羽矯殺卿子冠軍，自尊，罪二也。羽當以救趙還 報，而擅劫諸侯兵入關，罪三也。懷王約，入秦無暴掠，羽燒秦宮室，掘始皇帝塚，收 私其財，罪四也。又強殺秦降王子嬰，罪五也。詐坑秦子弟新安二十萬，王其將，罪六 也。皆王諸將善地，而徙逐故主，令臣下爭畔逆。罪七也。出逐義帝彭城，自都之，奪 韓王地，並王梁、楚，多自與，罪八也。使人陰殺義帝江南，罪九也。夫為人臣而殺其 主，殺其已降，為政不平，主約不信，天下所不容，大逆無道，罪十也。吾以義兵從諸 侯誅殘賊，使刑余罪人擊公，何苦乃與公挑戰！」羽大怒，伏弩射中漢王。漢王傷胸， 乃捫足曰：「虜中吾指！」漢王病創臥，張良強請漢王起行勞軍，以安士卒，毋令楚乘 勝。漢王出行軍，疾甚，因馳入成皋。

  十一月，韓信與灌嬰擊破楚軍，殺楚將龍且，追至城陽，虜齊王廣。齊相田橫自立
為齊王，奔彭越。漢立張耳為趙王。
  漢王疾愈，西入關，至櫟陽，存問父老，置酒。梟故塞王欣頭櫟陽市。留四日，複
如軍，軍廣武。關中兵益出，而彭越、田橫居梁地，往來苦楚兵，絕其糧食。
  韓信已破齊，使人言曰：「齊邊楚，權輕，不為假王，恐不能安齊。」漢王怒，欲
攻之。張良曰：「不如因而立之，使自為守。」春二月，遣張良操印，立韓信為齊王。
　　秋七月，立黥布為淮南王。

　　八月，初為算賦。北貉、燕人來致梟騎助漢。漢王下令：軍士不幸死者，吏為衣衾 棺斂，轉送其家。四方歸心焉。

　　項羽自知少助食盡，韓信又進兵擊楚，羽患之。漢遣陸賈說羽，請太公，羽弗聽。 漢複使侯公說羽，羽乃與漢約，中分天下，割鴻溝以西為漢，以東為楚。九月，歸太公 、呂後，軍皆稱萬歲。乃封侯公為平國君。羽解而東歸。漢王欲西歸，張良、陳平諫曰 ：「今漢有天下太半，而諸侯皆附，楚兵罷食盡，此天亡之時，不因其幾而遂取之，此 養虎自遺患也。」漢王從之。

　　五年冬十月，漢王追項羽至陽夏南，止軍，與齊王信、魏相國越期會擊楚。至固陵 ，不會。楚擊漢軍，大破之，漢王複入壁，深塹而守。謂張良曰：「諸侯不從，奈何？ 」良對曰：「楚兵且破，未有分地，其不至固宜。君王能與共天下，可立致也。齊王信 之立，非君王意，信亦不自堅。彭越本定梁地，始，君王以魏豹故，拜越為相國。今豹 死，越亦望王，而君王不早定。今能取睢陽以北至穀城皆以王彭越，從陳以東傅海與齊 王信，信家在楚，其意欲複得故邑。能出捐此地以許兩人，使各自為戰，則楚易散也」 。於是漢王發使使韓信、彭越。至，皆引兵來。

  十一月，劉賈入楚地，圍壽春。漢亦遣人誘楚大司馬周殷。殷畔楚，以舒屠六，舉
九江兵迎黥布，並行屠城父，隨劉賈皆會。
  十二月，圍羽垓下。羽夜聞漢軍四面皆楚歌，知盡得楚地。羽與數百騎走，是以兵
大敗。灌嬰追斬羽東城。
　　楚地悉定，獨魯不下。漢王引天下兵欲屠之，為其守節禮義之國，乃持羽頭示其父 兄，魯乃降。初，懷王封羽為魯公，及死，魯又為之堅守，故以魯公葬羽於穀城。漢王 為發喪，哭臨而去。封項伯等四人為列侯，賜姓劉氏。諸民略在楚者皆歸之。

　　漢王還至定陶，馳入齊王信壁，奪其軍。

　　初項羽所立臨江王共敖前死，子尉嗣立為王，不降。遣盧綰、劉賈擊虜尉。

　　春正月，追尊兄伯號曰武哀侯。下令曰：「楚地已定，義帝亡後，欲存恤楚眾，以 定其主。齊王信習楚風俗，更立為楚王，王淮北，都下邳。魏相國建城侯彭越勤勞魏民 ，卑下士卒，常以少擊眾，數破楚軍，其以魏故地王之，號曰梁王，都定陶。」又曰： 「兵不得休八年，萬民與苦甚，今天下事畢，其赦天下殊死以下。」

　　於是諸侯上疏曰：「楚王韓信、韓王信、淮南王英布、梁王彭越、故衡山王吳芮、 趙王張敖、燕王臧荼昧死再拜言大王陛下：先時，秦為亡道，天下誅之。大王先得秦王 ，定關中，於天下功最多。存亡定危，救敗繼絕，以安萬民，功盛德厚。又加惠于諸侯 王有功者，使得立社稷。地分已定，而位號比擬，亡上下之分，大王功德之著，于後世 不宣。昧死再拜上皇帝尊號。」漢王曰：「寡人聞帝者賢者有也，虛言亡實之名，非所 取也。今諸侯王皆推高寡人，將何以處之哉？」諸侯王皆曰：「大王起于細微，滅亂秦 ，威動海內。又以辟陋之地，自漢中行威德，誅不義，立有功，平定海內，功臣皆受地 食邑，非私之地。大王德施四海，諸侯王不足以道之，居帝位甚實宜，願大王以幸天下 。」漢王曰：「諸侯王幸以為便於天下之民，則可矣。」於是諸侯王及太尉長安侯臣綰 等三百人，與博士稷嗣君叔孫通謹擇良日二月甲午，上尊號。漢王即皇帝位於汜水之陽 。尊王后曰皇后，太子曰皇太子，追尊先媼曰昭靈夫人。

　　詔曰：「故衡山王吳芮與子二人、兄子一人，從百粵之兵，以佐諸侯，誅暴秦，有 大功，諸侯立以為王。項羽侵奪之地，謂之番君。其以長沙、豫章、象郡、桂林、南海 立番君芮為長沙王。」又曰：「故粵王亡諸世奉粵祀，秦侵奪其地，使其社稷不得血食 。諸侯伐秦，亡諸身帥閩中兵以佐滅秦，項羽廢而弗立。今以為閩粵王，王閩中地，勿 使失職。」

　　帝乃西都洛陽。夏五月，兵皆罷歸家。詔曰：「諸侯子在關中者，複之十二歲，其 歸者半之。民前或相聚保山澤，不書名數，今天下已定，令各歸其縣，複故爵田宅，吏 以文法教訓辨告，勿笞辱。民以饑餓自賣為人奴婢者，皆免為庶人。軍吏卒會赦，甚亡 罪而亡爵及不滿大夫者，皆賜爵為大夫。故大夫以上，賜爵各一級。其七大夫以上，皆 令食邑；非七大夫以下，皆複其身及戶，勿事。」又曰：「七大夫、公乘以上，皆高爵 也。諸侯子及從軍歸者，甚多高爵，吾數詔吏先與田宅，及所當求於吏者，亟與。爵或 人君，上所尊禮，久立吏前，曾不為決，其亡謂也。異日秦民爵公大夫以上，令丞與亢 禮。今吾於爵非輕也，吏獨安取此！且法以有功勞行田宅，今小吏未嘗從軍者多滿，而 有功者顧不得，背公立私，守尉長吏教訓甚不善。其令諸吏善遇高爵，稱吾意。且廉問 ，有不如吾詔者，以重論之。」

　　帝置酒雒陽南宮。上曰：「通侯諸將毋敢隱朕，皆言其情。吾所以有天下者何？項 氏之所以先天下者何？」高起、王陵對曰：「陛下嫚而侮人，項羽仁而敬人。然陛下使 人攻城掠地，所降下者，因以與之，與天下同利也。項羽妒賢嫉能，有功者害之，賢者 疑之，戰勝而不與人功，得地而不與人利，此其所以先天下也。」上曰：「公知其一， 未知其二。夫運籌帷幄之中，決勝千里之外，吾不如子房；填國家，撫百姓，給餉饋， 不絕糧道，吾不如蕭何；連百萬之眾，戰必勝，攻必取，吾不如韓信。三者皆人傑，吾 能用之，此吾所以取天下者也。項羽有一範增而不能用，此所以為我禽也。」群臣說服 。

　　初，田橫歸彭越。項羽已滅，橫懼誅，與賓客亡入海。上恐其久為亂，遣使者赦橫 ，曰：「橫來，大者王，小者侯；不來，且發兵加誅。」橫懼，乘傳詣雒陽，未至三十 裏，自殺。上壯其節，為流涕，發卒二千人，以上禮葬焉。

　　戍卒婁敬求見，說上曰：「陛下取天下與周異，而都雒陽，不便，不如入關，據秦 之固。」上以問張良，良因勸上。是日，車駕西都長安。拜婁敬為奉春君，賜姓劉氏。

　　六月壬辰，大赦天下。

　　秋七月，燕王臧荼反，上自將征之。

  九月，虜荼。詔諸侯王視有功者立以為燕王。荊王臣信等十人皆曰：「太尉長安侯
盧綰功最多，請立以為燕王。」使丞相噲將兵平代地。
  利幾反，上自擊破之。利幾者，項羽將。羽敗，利幾為陳令，降，上侯之潁川。上
至雒陽，舉通侯籍召之，而利幾恐，反。
　　後九月，徙諸侯子關中。治長樂宮。

　　六年冬十月，令天下縣邑城。

　　人告楚王信謀反，上問左右，左右爭欲擊之。用陳平計，乃偽遊雲夢。十二月，會 諸侯于陳，楚王信迎謁，因執之。詔曰：「天下既安，豪桀有功者封侯，新立，未能盡 圖其功。身居軍九年，或未習法令，或以其故犯法，大者死刑，吾甚憐之。其赦天下。 」田肯賀上曰：「甚善，陛下得韓信，又治秦中。秦，形勝之國也，帶河阻山，縣隔千 里，持戟百萬，秦得百二焉。地勢便利，其以下兵于諸侯，譬猶居高屋之上建瓴水也。 夫齊，東有琅邪、即墨之饒，南有泰山之固，西有濁河之限，北有勃海之利，地方二千 里，持戟百萬，縣隔千里之外，齊得十二焉，此東西秦也。非親子弟，莫可使王齊者。 」上曰：「善。」賜金五百斤。上還至雒陽，赦韓信，封為淮陰侯。

　　甲申，始剖符封功臣曹參等為通侯。詔曰：「齊，古之建國也，今為郡縣，其複以 為諸侯。將軍劉賈數有大功，及擇寬惠修絜者，王齊、荊地。」春正月丙午，韓王信等 奏請以故東陽郡、鄣郡、吳郡五十三縣立劉賈為荊王；以碭郡、薛郡、郯郡三十六縣立 弟文信君交為楚王。壬子，以雲中、雁門、代郡五十三縣立兄宜信侯喜為代王；以膠東 、膠西、臨淄、濟北、博陽、城陽郡七十三縣立子肥為齊王；以太原郡三十一縣為韓國 ，徙韓王信都晉陽。

　　上已封大功臣二十余人，其餘爭功，未得行封。上居南宮，從複道上見諸將往往耦 語，以問張良。良曰：「陛下與此屬共取天下，今已為天子，而所封皆故人所愛，所誅 皆平生仇怨。今軍吏計功，以天下為不足用遍封，而恐以過失及誅，故相聚謀反耳。」 上曰：「為之奈何？」良曰：「取上素所不快，計群臣所共知最甚者一人，先封以示群 臣。」三月，上置酒，封雍齒，因趣丞相急定功行封。罷酒，群臣皆喜，曰：「雍齒且 侯，吾屬亡患矣！」

　　上歸櫟陽，五日一朝太公。太公家令說太公曰：「天亡二日，土亡二王。皇帝雖子 ，人主也；太公雖父，人臣也。奈何令人主拜人臣！如此，則威重不行。」後上朝，太 公擁彗，迎門卻行。上大驚，下扶太公。太公曰：「帝，人主，奈何以我亂天下法！」 於是上心善家令言，賜黃金五百斤。夏五月丙午，詔曰：「人之至親，莫親于父子，故 父有天下傳歸於子，子有天下尊歸於父，此人道之極也。前日天下大亂，兵革並起，萬 民苦殃，朕親被堅執銳，自帥士卒，犯危難，平暴亂，立諸侯，偃兵息民，天下大安， 此皆太公之教訓也。諸王、通侯、將軍、群卿、大夫已尊朕為皇帝，而太公未有號，今 上尊太公曰太上皇。」

　　秋九月，匈奴圍韓王信于馬邑，信降匈奴。

　　七年冬十月，上自將擊韓王信於銅鞮，斬其將。信亡走匈奴，其將曼丘臣、王黃共 立故趙後趙利為王，收信散兵，與匈奴共距漢。上從晉陽連戰，乘勝逐北，至樓煩，會 大寒，士卒墮指者什二三。遂至平城，為匈奴所圍，七日，用陳平秘計得出。使樊噲留 定代地。

　　十二月，上還過趙，不禮趙王。是月，匈奴攻代，代王喜棄國，自歸雒陽，赦為合 陽侯。辛卯，立子如意為代王。

　　春，令郎中有罪耐以上，請之。民產子，複勿事二歲。

　　二月，至長安。蕭何治未央宮，立東闕、北闕、前殿、武庫、大倉。上見其壯麗， 甚怒，謂何曰：「天下匈匈，勞苦數歲，成敗未可知，是何治宮室過度也！」何曰：「 天下方未定，故可因以就宮室。且夫天子以四海為家，非令壯麗亡以重威，且亡令後世 有以加也。」上說。自櫟陽徙都長安。置宗正官以序九族。夏四月，行如雒陽。

　　八年冬，上東擊韓信余寇於東垣。還過趙，趙相貫高等恥上不禮其王，陰謀欲弑上 。上欲宿，心動，問「縣名何？曰：「柏人。」上曰：「柏人者，迫於人也。」去弗宿 。

  十一月，令士卒從軍死者，為槥歸其縣，縣給衣衾棺葬具，祠以少牢，長吏視葬。
十二月，行自東垣至。
  春三月，行如雒陽。令吏卒從軍至平城及守城邑者皆複終身勿事。爵非公乘以上毋
得冠劉氏冠。賈人毋得衣錦、繡、綺、□、絺、□、□，操兵，乘騎馬。
　　秋八月，吏有罪未發覺者，赦之。

　　九月，行自雒陽至。淮南王、梁王、趙王、楚王皆從。

　　九年冬十月，淮南王、梁王、趙王、楚王朝未央宮。置酒前殿，上奉玉卮為太上皇 壽，曰：「始大人常以臣亡賴，不能治產業，不如仲力。今某之業所就孰與仲多？」殿 上群臣皆稱萬歲，大笑為樂。

　　十一月，徙齊、楚大族昭氏、屈氏、景氏、懷氏、田氏五姓關中，與利田宅。

　　十二月，行如雒陽。

  貫高等謀逆發覺，逮捕高等，並捕趙王敖下獄。詔敢有隨王，罪三族。郎中田叔、
孟舒等十人自髡鉗為王家奴，從王就獄。王實不知其謀。
  春正月，廢趙王敖為宣平侯。徙代王如意為趙王，王趙國。丙寅，前有罪殊死以下
皆赦之。
  二月，行自雒陽至。賢趙臣田叔、孟舒等十人，召見與語，漢廷臣無能出其右者。
上說，盡拜為郡守、諸侯相。
　　夏六月乙未晦，日有食之。

　　十年冬十月，淮南王、燕王、荊王、梁王、楚王、齊王、長沙王來朝。

　　夏五月，太上皇後崩。秋七月癸卯，太上皇崩，葬萬年。赦櫟陽囚死罪以下。

　　八月，令諸侯王皆立太上皇廟于國都。

　　九月，代相國陳豨反。上曰：「豨嘗為吾使，甚有信。代地吾所急，故封豨為列侯 ，以相國守代，今乃與王黃等劫掠代地！吏民非有罪也，能去豨、黃來歸者，皆赦之。 」上自東，至邯鄲。上喜曰：「豨不南據邯鄲而阻漳水，吾知其亡能為矣。」趙相周昌 奏常山二十五城亡其二十城，請誅守、尉。上曰：「守、尉反乎？」對曰：「不。」上 曰：「是力不足，亡罪。」上令周昌選趙壯士可令將者，白見四人。上嫚罵曰：「豎子 能為將乎！」四人慚，皆伏地。上封各千戶，以為將。左右諫曰：「從入蜀、漢，伐楚 ，賞未遍行，今封此，何功？」上曰：「非汝所知。陳豨反，趙、代地皆豨有。吾以羽 檄征天下兵，未有至者，今計唯獨邯鄲中兵耳。吾何愛四千戶，不以慰趙子弟！」皆曰 ：「善。」又求：「樂毅有後乎？」得其孫叔，封之樂鄉，號華成君。問豨將，皆故賈 人。上曰：「吾知與之矣。」乃多以金購豨將，豨將多降。

　　十一年冬，上在邯鄲。豨將侯敞將萬餘人遊行，王黃將騎千余軍曲逆，張春將卒萬 餘人度河攻聊城。漢將軍郭蒙與齊將擊，大破之。太尉周勃道太原入定代地，至馬邑， 馬邑不下，攻殘之。豨將趙利守東垣，高祖攻之不下。卒罵，上怒。城降，卒罵者斬之 。諸縣堅守不降反寇者，複租賦三歲。

　　春正月，淮陰侯韓信謀反長安，夷三族。將軍柴武斬韓王信於參合。

　　上還雒陽。詔曰：「代地居常山之北，與夷狄邊，趙乃從山南有之，遠，數有胡寇 ，難以為國。頗取山南太原之地益屬代，代之雲中以西為雲中郡，則代受邊寇益少矣。 王、相國、通侯、吏二千石擇可立為代王者。」燕王綰、相國何等三十三人皆曰：「子 恒賢知溫良，請立以為代王，都晉陽。」大赦天下。

　　二月，詔曰：「欲省賦甚。今獻未有程，吏或多賦以為獻，而諸侯王尤多，民疾之 。令諸侯王、通侯常以十月朝獻，即郡各以其口數率，人歲六十三錢，以給獻費。」又 曰：「蓋聞王者莫高於周文，伯者莫高於齊桓，皆待賢人而成名。今天下賢者智慧，豈 特古之人乎？患在人主不交故也，士奚由進！今吾以天之靈、賢士大夫定有天下，以為 一家，欲其長久，世世奉宗廟亡絕也。賢人已與我共平之矣，而不與吾共安利之，可乎 ？賢士大夫有肯從我遊者，吾能尊顯之。佈告天下，使明知朕意。御史大夫昌下相國， 相國酂侯下諸侯王，禦史中執法下郡守，其有意稱明德者，必身勸，為之駕，遣詣相國 府，署行、義、年。有而弗言，覺，免。年老癃病，勿遣。」

　　三月，梁王彭越謀反，夷三族。詔曰：「擇可以為梁王、淮陽王者。」燕王綰、相 國何等請立子恢為梁王，子友為淮陽王。罷東郡，頗益梁；罷潁川郡，頗益淮陽。

　　夏四月，行自雒陽至。令豐人徙關中者皆複終身。

　　五月，詔曰：「粵人之俗，好相攻擊，前時秦徙中縣之民南方三郡，使與百粵雜處 。會天下誅秦，南海尉它居南方長治之，甚有文理，中縣人以故不耗減，粵人相攻擊之 俗益止，俱賴其力。今立它為南粵王。」使陸賈即授璽、綬。它稽首稱臣。

　　六月，令士卒從入蜀、漢、關中者皆複終身。

　　秋七月，淮南王布反。上問諸將，滕公言故楚令尹薛公有籌策。上召見，薛公言布 形勢，上善之，封薛公千戶。詔王、相國擇可立為淮南王者，群臣請立子長為王。上乃 發上郡、北地、隴西車騎，巴、蜀材官及中尉卒三萬人為皇太子衛，軍霸上。布果如薛 公言，東擊殺荊王劉賈，劫其兵，度淮擊楚，楚王交走入薛。上赦天下死罪以下，皆令 從軍；征諸侯兵，上自將以擊布。

　　十二年冬十月，上破布軍於會缶。布走，令別將追之。

　　上還，過沛，留，置酒沛宮，悉召故人父老子弟佐酒。發沛中兒得百二十人，教之 歌。酒酣，上擊築自歌曰：「大風起兮雲飛揚，威加海內兮歸故鄉，安得猛士兮守四方 ！」令兒皆和習之。上乃起舞，忼慨傷懷，泣數行下。謂沛父兄曰：「遊子悲故鄉。吾 雖都關中，萬歲之後吾魂魄猶思沛。且朕自沛公以誅暴逆，遂有天下，其以沛為朕湯沐 邑，複其民，世世無有所與。」沛父老諸母故人日樂飲極歡，道舊故為笑樂。十餘日， 上欲去，沛父兄固請。上曰：「吾人眾多，父兄不能給。」乃去。沛中空縣皆之邑西獻 。上留止，張飲三日。沛父兄皆頓首曰：「沛幸得複，豐未得，唯陛下哀矜。」上曰： 「豐者，吾所生長，極不忘耳。吾特以其為雍齒故反我為魏。」沛父兄固請之，乃並複 豐，比沛。

　　漢別將擊布軍洮水南北，皆大破之，追斬布番陽。

　　周勃定代，斬陳豨於當城。

　　詔曰：「吳，古之建國也。日者荊王兼有其地，今死亡後。朕欲複立吳王，其議可 者。」長沙王臣等言：「沛侯濞重厚，請立為吳王。」已拜，上召謂濞曰：「汝狀有反 相。」因拊其背，曰：「漢後五十年東南有亂，豈汝邪？然天下同姓一家，汝慎毋反。 」濞頓首曰：「不敢。」

　　十一月，行自淮南還。過魯，以大牢祠孔子。

　　十二月，詔曰：「秦皇帝、楚隱王、魏安釐王、齊湣王、趙悼襄王皆絕亡後。其與 秦始皇帝守塚二十家，楚、魏、齊各十家，趙及魏公子亡忌各五家，令視其塚，複，亡 與它事。」

　　陳豨降將言豨反時燕王盧綰使人之豨所陰謀。上使辟陽侯審食其迎綰，綰稱疾。食 其言綰反有端。春二月，使樊噲、周勃將兵擊綰。詔曰：「燕王綰與吾有故，愛之如子 ，聞與陳豨有謀，吾以為亡有，故使人迎綰。綰稱疾不來，謀反明矣。燕吏民非有罪也 ，賜其吏六百石以上爵各一級。與綰居，去來歸者，赦之，加爵亦一級。」詔諸侯王議 可立為燕王者。長沙王臣等請立子建為燕王。

　　詔曰：「南武侯織亦粵之世也，立以為南海王。」

　　三月，詔曰：「吾立為天子，帝有天下，十二年於今矣。與天下之豪士賢大夫共定 天下，同安輯之。其有功者上致之王，次為列侯，下乃食邑。而重臣之親，或為列侯， 皆令自置吏，得賦斂，女子公主。為列侯食邑者，皆佩之印，賜大第室。吏二千石，徙 之長安，受小第室。入蜀、漢定三秦者，皆世世複。吾于天下賢士功臣，可謂亡負矣。 其有不義背天子擅起兵者，與天下共伐誅之。佈告天下，使明知朕意。」

　　上擊布時，為流矢所中，行道疾。疾甚，呂後迎良醫。醫入見，上問醫。曰：「疾 可治。」於是上嫚罵之，曰：「吾以布衣提三尺取天下，此非天命乎？命乃在天，雖扁 鵲何益！」遂不使治疾，賜黃金五十斤，罷之。呂後問曰：「陛下百歲後，蕭相國既死 ，誰令代之？」上曰：「曹參可。」問其次，曰：「王陵可，然少戇，陳平可以助之。 陳平知有餘，然難獨任。周勃重厚少文，然安劉氏者必勃也，可令為太尉。」呂後複問 其次，上曰：「此後亦非乃所知也。」

　　盧綰與數千人居塞下候伺，幸上疾愈，自入謝。夏四月甲辰，帝崩于長樂宮。盧綰 聞之，遂亡入匈奴。

　　呂後與審食其謀曰：「諸將故與帝為編戶民，北面為臣，心常鞅鞅，今乃事少主， 非盡族是，天下不安。」以故不發喪。人或聞，以語酈商。酈商見審食其曰：「聞帝已 崩四日，不發喪，欲誅諸將。誠如此，天下危矣。陳平、灌嬰將十萬守滎陽，樊噲、周 勃將二十萬定燕、代，此聞帝崩，諸將皆誅，必連兵還鄉，以攻關中。大臣內畔，諸將 外反，亡可蹺足待也。」審食其入言之，乃以丁未發喪，大赦天下。

　　五月丙寅，葬長陵。已下，皇太子、群臣皆反至太上皇廟。群臣曰：「帝起細微， 撥亂世反之正，平定天下，為漢太祖，功最高。」上尊號曰高皇帝。

　　初，高祖不修文學，而性明達，好謀，能聽，自監門戍卒，見之如舊。初順民心作 三章之約。天下既定，命蕭何次律令，韓信申軍法，張蒼定章程，叔孫通制禮儀，陸賈 造《新語》。又與功臣剖符作誓，丹書鐵契，金匱石室，藏之宗廟。雖日不暇給，規摹 弘遠矣。

　　贊曰：《春秋》晉史蔡墨有言：陶唐氏既衰，其後有劉累，學擾龍，事孔甲，範氏 其後也。而大夫范宣子亦曰：「祖自虞以上為陶唐氏，在夏為禦龍氏，在商為豕韋氏， 在周為唐杜氏，晉主夏盟為範氏。」范氏為晉士師，魯文公世奔秦。後歸於晉，其處者 為劉氏。劉向雲戰國時劉氏自秦獲于魏。秦滅魏，遷大樑，都于豐，故周市說雍齒曰： 「豐，故梁徙也。」是以頌高祖雲：「漢帝本系，出自唐帝。降及于周，在秦作劉。涉 魏而東，遂為豐公。」豐公，蓋太上皇父。其遷日淺，墳墓在豐鮮焉。及高祖即位，置 祠祀官，則有秦、晉、梁、荊之巫，世祠天地，綴之以祀，豈不信哉！由是推之，漢承 堯運，德祚已盛，斷蛇著符，旗幟上赤，協於火德，自然之應，得天統矣。


`,Be=`
인터내셔널 부커상, 산클레멘테 문학상 수상작

전세계가 주목한 한강의 역작을 다시 만나다



2016년 인터내셔널 부커상을 수상하며 한국문학의 입지를 한단계 확장시킨 한강의 장편소설 『채식주의자』를 15년 만에 새로운 장정으로 선보인다. 상처받은 영혼의 고통과 식물적 상상력의 강렬한 결합을 정교한 구성과 흡인력 있는 문체로 보여주는 이 작품은 섬뜩한 아름다움의 미학을 한강만의 방식으로 완성한 역작이다. “탄탄하고 정교하며 충격적인 작품으로, 독자들의 마음에 그리고 아마도 그들의 꿈에 오래도록 머물 것이다”라는 평을 받으며 인터내셔널 부커상을 수상했던 『채식주의자』는 “미국 문학계에 파문을 일으키면서도 독자들과 공명할 것으로 보인다”(뉴욕타임스), “놀라울 정도로 아름다운 산문과 믿을 수 없을 만큼 폭력적인 내용의 조합이 충격적이다”(가디언)라는 해외서평을 받았고 2018년에는 스페인에서 산클레멘테 문학상을 받는 등 전세계에서 뜨거운 반응을 일으켰다. 국내에서는 현재까지 100만부 가까이 판매되었다.

『채식주의자』는 어느 날부터 육식을 거부하며 가족들과 갈등을 빚기 시작하는 ‘영혜’가 중심인물로 등장하는 장편소설이다. 하지만 소설은 영혜를 둘러싼 세 인물인 남편, 형부, 언니의 시선에서 서술되며 영혜는 단 한번도 주도적인 화자의 위치를 얻지 못한다. 가족의 이름으로 자행되는 가부장의 폭력, 그리고 그 폭력에 저항하며 금식을 통해 동물성을 벗어던지고 나무가 되고자 한 영혜가 보여주는 식물적 상상력의 경지는 모든 세대 독자를 아우르며 더 크나큰 공명을 이루어낼 것이다.



폭력과 아름다움의 처절한 공존

여전히 새롭게 읽히는 한강 소설의 힘



2007년 창비에서 출간된 『채식주의자』는 2010년부터 일본, 중국, 프랑스 등 여러 나라에서 꾸준히 번역 출간돼왔으며 2015년 문학의 명문 출판사인 포르토벨로가 영어판을 낸 뒤 영국 포일스(Foyles)서점에서 소설분야 톱10에서 1위에 오르는 등 화제를 모았다. 2016년 미국 최대 출판그룹 중 하나인 펭귄랜덤하우스 그룹의 문학전문 임프린트 호가드(Hogarth)에서 미국판이 출간된 이후에는 『뉴욕타임스』 『워싱턴포스트』 『시카고트리뷴』 『라이브러리저널』 등을 비롯해 다수의 유력 매체에서 호평을 받기도 했다. 출판전문지 『퍼블리셔스위클리』는 ‘2016년 봄, 가장 기대되는 주목할 소설’ 중 첫째로 『채식주의자』를 꼽기도 하는 등 빠르게 화제의 중심에 올라선 바 있다. 그리고 드디어 2016년 인터내셔널 부커상을 수상하며 명실상부 세계적인 작품으로 자리했다.

『채식주의자』의 1부 「채식주의자」는 영혜 남편인 ‘나’의 시선으로 서술된다. 어린 시절 자신의 다리를 문 개를 죽이는 장면이 뇌리에 박힌 영혜는 어느 날 꿈에 나타난 끔찍한 영상에 사로잡혀 육식을 멀리하기 시작한다. 영혜의 행동을 이해할 수 없는 ‘나’는 처가 사람들을 동원해 영혜를 말리고자 한다. 영혜의 언니 인혜의 집들이에서 영혜는 또 육식을 거부하고, 이에 못마땅한 장인이 강제로 영혜의 입에 고기를 넣으려 하자, 영혜는 그 자리에서 손목을 긋는다. 2부 「몽고반점」은 인혜의 남편이자 영혜의 형부인 비디오아티스트 ‘나’의 시선으로 진행된다. 아내 인혜에게서 영혜의 엉덩이에 아직도 몽고반점이 남아 있다는 이야기를 들은 ‘나’는 영혜의 몸을 욕망하게 된다. ‘나’는 영혜를 찾아가 비디오작품의 모델이 되어달라고 청한다. ‘나’는 결국 자신의 몸에 꽃을 그려 영혜와 교합한 뒤 비디오작품을 촬영하고 다음 날 벌거벗은 두 사람의 모습을 아내가 발견한다. 3부 「나무 불꽃」은 가족들 모두 등 돌린 영혜의 병수발을 들어야 하는 인혜의 시선으로 진행된다. 인혜는 식음을 전폐하고 링거조차 받아들이지 않아 나뭇가지처럼 말라가는 영혜를 만나고, 영혜는 자신이 이제 곧 나무가 될 거라고 말한다.

어린 시절 각인된 폭력의 기억 때문에 철저히 육식을 거부한 채로 나무가 되기를 꿈꾸는 영혜는 폭력의 악순환을 끊고 다른 생명에게 어떠한 해도 끼치지 않는 무해한 존재를 꿈꾸는 것처럼 보인다. 인간 본질에 대해 쉼 없이 질문하며 ‘고통’에 대해 천착해온 작가는 이번 개정판을 출간하며 “고백하자면 이 책에 복잡한 감정을 품고 있었다. (…) 하지만 귀밑머리가 희어지고 어느 때보다 머리가 맑은 지금, 나에게는 이 소설을 껴안을 힘이 있다. 여전히 생생한 고통과 질문으로 가득 찬 이 책을”(새로 쓴 작가의 말)이라고 밝히기도 했다.

한편 『채식주의자』는 지금까지 40개국 이상에 판권이 수출됐다. 올해 9월에는 연극으로 제작되어 국립극단 무대에 오른 뒤 12월 벨기에 리에주극장에서 해외 관객들과도 만날 예정이다.
`,ze=U({__name:"TokenizePage",setup(o,{expose:a}){a();const{t:c}=J({useScope:"global"}),e=g(!1),k=g([]),b=g([]),n=g("english");let d=null;ke({page:"tokenizer",banner:"banner-segmenter-api.png",url:"tokenizer"});const C=$(),A=g([{label:c("tokenizer.english"),value:"english"},{label:c("tokenizer.chinese"),value:"chinese"},{label:c("tokenizer.japanese"),value:"japanese"},{label:c("tokenizer.korean"),value:"korean"}]),u=[{label:"landing_page.get_api_now",icon:"code",anchor:"#apiform"},{label:"tokenizer.chunking_short",icon:"insert_page_break",anchor:"#chunking"}],q=g(1e3),s=g("Jina AI: Your Search Foundation, Supercharged! 🚀Ihrer Suchgrundlage, aufgeladen! 🚀您的搜索底座，从此不同！🚀検索ベース,もう二度と同じことはありません！🚀"),l=g(E);G(()=>{n.value==="english"?l.value=E:n.value==="chinese"?l.value=Te:n.value==="japanese"?l.value=qe:n.value==="korean"&&(l.value=Be)});const f=m=>{let S="https://api.jina.ai/v1/segment",V={content:s.value,return_tokens:!0};m&&(V={content:l.value,return_chunks:!0,max_chunk_length:q.value}),e.value=!0,fetch(S,{method:"POST",headers:{"Content-Type":"application/json"},body:JSON.stringify(V)}).then(w=>w.json()).then(w=>{m?b.value=w.chunks:k.value=w.tokens}).catch(w=>{C.notify({color:"negative",message:c("landing_page.error",{message:w}),icon:"report_problem"})}).finally(()=>e.value=!1)},p=K("componentRef"),T=()=>{const m=p.value;m instanceof HTMLElement?(d=new IntersectionObserver(S=>{S[0].isIntersecting&&(e.value||(f(!1),f(!0)),d==null||d.disconnect())},{root:null,threshold:.1}),d.observe(m)):console.error("Element is not an HTMLElement:",m)};Y(()=>{Z(()=>{setTimeout(()=>{T()},100)})}),X(()=>{d&&d.disconnect()});const B={t:c,isBusy:e,exampleTokens:k,exampleChunks:b,exampleTextChoice:n,get observer(){return d},set observer(m){d=m},$q:C,exampleTextOptions:A,titleButtons:u,maxChunkLength:q,rawContent:s,rawContent2:l,executeAdaptableJSCode:f,componentRef:p,initIntersectionObserver:T,removeLineBreaks:()=>{l.value=l.value.replace(/\n/g," ")},TitleBlock:be,FAQComponent:ye,SeFoComponent:ve,H2TitleBlock:_e,TokenVisualizer:ce,RateLimitComponent:xe,ColorChunks:me};return Object.defineProperty(B,"__isScriptSetup",{enumerable:!1,value:!0}),B}}),Ie={class:"col-12 col-md-11 q-py-xl q-mx-xs-xs q-mx-sm-sm q-mx-md-md q-mx-lg-lg q-mx-xl-xl q-ma-xl relative-position"},Ae={class:"row justify-center"},Se={class:"col-12 col-sm-11 col-md-10 q-pb-xl"},Ve={class:"row justify-center"},Qe={class:"col-11 col-sm-10 col-md-8 col-lg-6"},je={class:"column items-center q-gutter-y-xl",ref:"componentRef"},De={class:"row justify-center"},Le={class:"col-11 col-sm-10 col-md-8 col-lg-6"},Re={class:"column items-center q-gutter-y-xl",ref:"componentRef"},Oe={class:"text-dim",style:{width:"70%"}},Ee={class:"q-my-xl row justify-center items-center",id:"rate-limit"},Fe={class:"col-11 col-md-8 text-subtitle1 q-my-lg",style:{"white-space":"pre-line"}};function He(o,a,c,e,k,b){return z(),Q(we,null,{default:r(()=>[i("div",{class:v(["row justify-center items-center img-bg q-py-xl",e.$q.screen.lt.sm?"q-px-md":"q-px-xl"])},[i("div",Ie,[t(e.TitleBlock,{title:e.t("landing_page.tokenizer"),tagline:e.t("tokenizer.description_long1"),"large-title":!0,buttons:e.titleButtons},null,8,["title","tagline"])])],2),i("div",{class:v(e.$q.screen.lt.sm?"q-pa-md":"q-pa-xl"),id:"apiform"},[t(e.H2TitleBlock,{title:"tokenizer.title",anchor:"apiform",subtitle:"tokenizer.description_long"}),i("div",Ae,[i("div",Se,[t(e.SeFoComponent,{"show-function":"tokenizer","hide-others":!0})])])],2),i("div",{class:v(e.$q.screen.lt.sm?"q-pa-md":"q-pa-xl"),id:"what_tokenizer"},[t(e.H2TitleBlock,{title:"tokenizer.what_is",anchor:"what_tokenizer",subtitle:"tokenizer.explain"}),i("div",Ve,[i("div",Qe,[i("div",je,[t(O,{modelValue:e.rawContent,"onUpdate:modelValue":a[0]||(a[0]=n=>e.rawContent=n),filled:"",type:"textarea",rows:"5",square:"",class:"full-width",label:e.t("tokenizer.input_text")},null,8,["modelValue","label"]),t(I,{label:e.t("reader.demo.get_response"),onClick:a[1]||(a[1]=n=>e.executeAdaptableJSCode(!1)),loading:e.isBusy,outline:"",icon:"send",square:"",padding:"lg",disable:e.rawContent.trim().length===0},null,8,["label","loading","disable"]),e.exampleTokens.length>0?(z(),Q(e.TokenVisualizer,{key:0,exampleTokens:e.exampleTokens},null,8,["exampleTokens"])):te("",!0)],512)])])],2),i("div",{class:v(e.$q.screen.lt.sm?"q-pa-md":"q-pa-xl"),id:"chunking"},[t(e.H2TitleBlock,{title:"tokenizer.chunking",anchor:"chunking",subtitle:"tokenizer.chunking_explain"}),i("div",De,[i("div",Le,[i("div",Re,[t(Ce,{modelValue:e.exampleTextChoice,"onUpdate:modelValue":a[2]||(a[2]=n=>e.exampleTextChoice=n),outline:"",square:"","toggle-color":"primary",options:e.exampleTextOptions},null,8,["modelValue","options"]),t(O,{modelValue:e.rawContent2,"onUpdate:modelValue":a[3]||(a[3]=n=>e.rawContent2=n),filled:"",type:"textarea",rows:"10",square:"",class:"full-width",label:e.t("tokenizer.input_text")},null,8,["modelValue","label"]),i("div",Oe,[t(ge,{"label-always":"",snap:"",modelValue:e.maxChunkLength,"onUpdate:modelValue":a[4]||(a[4]=n=>e.maxChunkLength=n),markers:"",min:500,max:2e3,step:100,"label-text-color":"dark","label-value":`${e.t("tokenizer.parameters.max_chunk_length")}: ${e.maxChunkLength}`},null,8,["modelValue","label-value"]),_(" "+x(e.t("tokenizer.parameters.max_chunk_length_explain")),1)]),t(F,{flat:"",outline:"",square:""},{default:r(()=>[t(I,{label:e.t("tokenizer.remove_boundary_cues"),onClick:e.removeLineBreaks,outline:"",icon:"subtitles_off",square:"",padding:"lg"},{default:r(()=>[t(fe,null,{default:r(()=>[_(x(e.t("tokenizer.remove_boundary_cues_explain")),1)]),_:1})]),_:1},8,["label"]),t(j),t(I,{label:e.t("reader.demo.get_response"),onClick:a[5]||(a[5]=n=>e.executeAdaptableJSCode(!0)),loading:e.isBusy,outline:"",icon:"send",square:"",padding:"lg",disable:e.rawContent2.trim().length===0},null,8,["label","loading","disable"])]),_:1}),t(ie,{flat:"",bordered:"",square:""},{default:r(()=>[t(L,{header:"",class:"text-white"},{default:r(()=>[_(x(e.t("tokenizer.chunks_in_total",{_numChunks:e.exampleChunks.length})),1)]),_:1}),t(j),t(D,{horizontal:e.$q.screen.gt.md,class:"q-pa-none"},{default:r(()=>[t(D,{class:"col-6 scroll",style:{"max-height":"50vh"}},{default:r(()=>[t(e.ColorChunks,{chunks:e.exampleChunks},null,8,["chunks"])]),_:1}),t(j,{vertical:e.$q.screen.gt.md},null,8,["vertical"]),t(D,{class:"col scroll q-pa-none",style:{"max-height":"50vh"}},{default:r(()=>[t(pe,{separator:""},{default:r(()=>[t(oe,{name:"list"},{default:r(()=>[(z(!0),ae(le,null,ne(e.exampleChunks,(n,d)=>se((z(),Q(re,{key:d,clickable:""},{default:r(()=>[t(de,null,{default:r(()=>[t(L,{caption:""},{default:r(()=>[t(he,{name:"segment"}),_(" "+x(`${e.t("tokenizer.chunk")} ${d}: ${n.length} ${e.t("tokenizer.chars")}`),1)]),_:2},1024),t(L,null,{default:r(()=>[_(x(`${n}`),1)]),_:2},1024)]),_:2},1024)]),_:2},1024)),[[ue]])),128))]),_:1})]),_:1})]),_:1})]),_:1},8,["horizontal"])]),_:1})],512)])])],2),i("div",{class:v(e.$q.screen.lt.sm?"q-pa-md":"q-pa-xl")},[t(e.H2TitleBlock,{title:"tokenizer.is_free",subtitle:"tokenizer.is_free_description"}),i("div",Ee,[i("div",Fe,[t(e.RateLimitComponent,{"show-action-buttons":!0})])])],2),t(e.FAQComponent,{"faq-sources":["tokenizer.faq_v1","api_general_faq","billing_general_faq"],dark:!0,"hide-license":!0})]),_:1})}const Qt=ee(ze,[["render",He],["__scopeId","data-v-7b3fe3a9"],["__file","TokenizePage.vue"]]);export{Qt as default};
